Repository: PetersSharp/stCoCServer
Catalog: stCoCServer/stExtLib/stNet-dll/Properties/Resources.*.resx
Languages: ru

# httpMinifyChanged
source: Minify detect file {0}: {1}, rebuild..
ru: Изменение фала списков {0}: {1}, начнаю минификацию..

# httpUtilMinifyFileNotFound
source: {0}: File '{1}' does not exist
ru: {0}: файл'{1}' не существует

# httpBoxButton
source: Continue
ru: Продолжить

# httpError
source: server response error:
ru: ошибка ответа сервера:

# httpLocalError
source: Web client is internal error
ru: Веб-клиент — внутренняя ошибка

# IPListEmpty
source: IP address is empty, or not valid
ru: IP-адрес является пустым или недопустимым

# IPListError
source: converting IP error: '{0}' - {1}
ru: преобразование IP ошибка: '{0}' - {1}

# upnpError
source: UPNP error: {0}
ru: Ошибка UPNP: {0}

# upnpFindServer
source: UPNP: find {0} devices
ru: UPNP: найти устройства {0}

# httpListenerEmptyResource
source: HTTP Resource Locator empty
ru: Локатор ресурса HTTP пустым

# httpListenerExceptionOnReq
source: HTTP Serv on Request:
ru: Серв HTTP по запросу:

# httpListenerExceptionAddResource
source: HTTP Serv add resource URI: {0}
ru: Серв HTTP добавить URI ресурса: {0}

# httpListenerExceptionStart
source: HTTP Serv Start Exception:
ru: Исключение серв Start HTTP:

# httpListenerExceptionStartHttp
source: HTTP Serv Start Http Exception:
ru: HTTP серв Start Http-исключение:

# httpListenerExceptionStop
source: HTTP Serv Stop Exception:
ru: Серв HTTP остановить исключение:

# httpListenerInit
source: HTTP Serv Init:
ru: HTTP серв Init:

# httpListenerNoSupport
source: Http Listener not supported
ru: Прослушиватель HTTP не поддерживается

# httpListenerNull
source: Http Listener is Null
ru: Прослушиватель HTTP имеет значение Null

# httpListenerUrlEmpty
source: Http URI empty
ru: HTTP URI пуст

# templateFileNotFound
source: Template file not found: {0}
ru: Шаблон не найден: {0}

# templateAppendObjEmpty
source: Template append object is empty
ru: Добавляемый объект шаблона является пустым

# templateDirectoryEmpty
source: Template directory is empty value
ru: Параметр каталога шаблонов является пустым

# templateDirectoryNotFound
source: Template directory not found: {0}
ru: Не найден каталог шаблонов: {0}

# templateFileNameEmpty
source: Template file name is empty value
ru: Имя файла шаблона имеет пустое значение

# httpHTMLBadRequest
source: <h3>({0}) URL not support</h3><b>Reason:</b> {1}<hr/><b>Generated:</b> {2}<br/>
ru: <h3>({0}) URL АДРЕС не поддерживается</h3><b>Причина:</b> {1}<hr><b>Создан:</b> {2}<br>!

# templateFileBusy
source: Template file is busy: {0} ({1})
ru: Файл шаблона используется другим процессом: {0} ({1})

# templateInsertFileNotFound
source: Template Insert file not found: {0}-{1}-{2}
ru: Не найдена вставка файл ашаблона: {0}-{1}-{2}

# httpUtilMinifyError
source: Minify {0} error: {1} {2}
ru: Преуменьшать {0} ошибка: {1} {2}

# curlProcessError8
source: curl process start: {0}
ru: Curl - начало процесса: {0}!

# curlProcessError9
source: curl tempoary path not set
ru: Curl - временный путь не установлен

# IRCKickMessage
source: bad guys '{0}', don't KICK channel BOT, understand?
ru: редиска '{0}' не следует выгнать бота с канала, иначе он выганит тебя!

# IRCDisconnectedMessage
source: QUIT Client Disconnected: {0}
ru: QUIT я ненадолго покину чат: {0}

# httpListenerExceptionLoop
source: HTTP Serv loop Exception:
ru: HTTP цикл, исключение:

# IRCAlreadyRunException
source: IRC already connected: {0}:{1}
ru: IRC уже подключен: {0}: {1}

# curlProcessError7
source: failed to quit in time
ru: не удалось выйти вовремя

# curlProcessError6
source: failed process standard output
ru: сбой процесса стандартный вывод

# curlProcessError5
source: curl exec: {0}
ru: Curl - выполнение: {0}

# curlProcessError4
source: return empty string
ru: Возвращена пустая строка

# curlProcessError3
source: process Faulted or Canceled
ru: процесс Faulted или Canceled

# curlProcessError2
source: failed process start info
ru: Ошибка запуска процесса

# curlProcessError1
source: curl executable not found
ru: Curl - исполняемый файл не найден!

# aclExceptioSourceFormat
source: IP range source string error format
ru: IP диапазон - строка имеет неверный формат

# aclExceptionStringCollection
source: IP range String Collection
ru: IP диапазон - источник коллекция строк

# aclExceptionList
source: IP range list
ru: Список диапазонов IP

# aclExceptionAddress
source: IP range address
ru: IP адрес диапазона

# aclExceptioConvertIpEnd
source: IP range convert end ip address
ru: IP диапазон - преобразование конечного IP адреса

# httpMinifyStreamRead
source: error Minify read stream:
ru: Ошибка минификации - нельзя прочесть поток:

# httpMinifyStreamOutNull
source: error Out stream writer is null:
ru: Ошибка записи - поток имеет значение null:

# httpCallbackNull
source: Http request function is Null
ru: Функция запроса HTTP имеет значение Null

# httpMinifyStreamReadNull
source: error In stream reader is null:
ru: Ошибка в потоке чтения имеет значение null:

# httpMinifyStreamOut
source: error Out write stream:
ru: Ошибка записи потока:

# httpMinifyStreamOrigin
source: error Origin stream read source:
ru: Ошибка чтения входных данных из потока

# httpMinifyStreamBinary
source: error binary reader
ru: Ошибка чтения двоичных данных

# httpMinifyOriginhead
source: Minify Origin: {0}
ru: Минификация уже проведена: {0}

# httpMinifyCSShead
source: Minify CSS: {0}
ru: Минификация CSS: {0}

# httpMinifyJShead
source: Minify JS: {0}
ru: Минификация JS: {0}

# httpMinifyConcatDisabled
source: Concat and Minify disabled..
ru: Минификация отключена..
