Repository: PetersSharp/stCoCServer
Catalog: stCoCServer/stExtLib/stCoCAPI-dll/Properties/Resources.*.resx
Languages: ru

# CoCClanIdEmpty
source: Clan ID is empty or not defined
ru: неопределен идентефикатор клана

# CoCClanTagEmpty
source: Clan Tag empty
ru: неопределен тэг клана

# CoCDBExceptionLength
source: {0}: parse cmd incorrect length
ru: {0}: ошибка разбора, команда имеет нулевую длинну

# CoCGetUrlEmpty
source: Get URL Json source is empty: {0}
ru: Json запрос вернул пустой ответ: {0}

# CoCInitError
source: Init {0} instance error: {1}
ru: инициализация {0} - ошибка: {1}

# CoCKeyEmpty
source: API key empty or not found, (see https://developer.clashofclans.com/)
ru: необходим API ключ, (смотри https://developer.clashofclans.com/)

# CoCMediaDownloadInfo
source: Update image: {0}{1}
ru: Обновление медиа файлов: {0}{1}

# CoCNotifyAddClient
source: Add client
ru: добавлен клиент

# CoCNotifyAddDataTable
source: Add data table
ru: добавлен контекст

# CoCNotifyDataOtherError
source: (see last error..)
ru: (смотри последнюю ошибку)

# CoCNotifyDataRss
source: Make RSS feed
ru: создание RSS канала

# fmtNotifyClanChangeLevel
source: Clan {0} change Level: {1} -> {2}{3}
ru: Клан {0} измененил уровень: {1}{2} -> {3}

# fmtNotifyClanChangeName
source: Clan {2} change Name: {3}
ru: Клан {2} измененил имя на: {3}

# fmtNotifyClanChangeMembers
source: Clan {0} change Members: {1}{2} -> {3}
ru: Клан {0} измененил количество участников: {1}{2} -> {3}

# fmtNotifyClanChangePoints
source: Clan {0} change Points: {1}{2} -> {3}
ru: Клан {0} измененил очки: {1}{2} -> {3}

# fmtNotifyClanChangeType
source: Clan {0} change Type: {2} -> {3}
ru: Клан {0} измененил статус (прием): {2} -> {3}

# fmtNotifyClanChangeTrophies
source: Clan {0} change Trophies: {1}{2} -> {3}
ru: Клан {0} измененил трофеи (прием): {1}{2} -> {3}

# fmtNotifyClanChangeWarFrequency
source: Clan {0} change WarFrequency: {2} -> {3}
ru: Клан {0} измененил период между войнами: {2} -> {3}

# fmtNotifyClanChangeWarSeries
source: Clan {0} change WarSeries: {1}{2} -> {3}
ru: Клан {0} измененил серию побед: {1}{2} -> {3}

# fmtNotifyClanChangeWarPublic
source: Clan {0} change WarPublic: {2} -> {3}
ru: Клан {0} измененил публичный ход войны: {2} -> {3}

# fmtNotifyClanChangeWarWin
source: Clan {0} change WarWin: {1}{2} -> {3}
ru: Клан {0} измененил выигранные войны: {1}{2} -> {3}

# fmtNotifyMemberChangeDonationSend
source: {0} - change Donation Send: {1}{2} -> {3}
ru: {0} измененил пожертвования: {1}{2} -> {3}

# fmtNotifyMemberChangeLeague
source: {0} - change League: {2} -> {3}
ru: {0} измененил лигу: {2} -> {3}

# fmtNotifyMemberChangeLevel
source: {0} - change Level: {1}{2} -> {3}
ru: {0} измененил уровень: {1}{2} -> {3}

# fmtNotifyMemberChangeNik
source: {2} - change Nik: {3}
ru: {2} измененил имя на: {3}

# fmtNotifyMemberChangeRole
source: {0} - change Role: {2} -> {3}
ru: {0} измененил звание: {2} -> {3}

# fmtNotifyMemberChangeTrophies
source: {0} - change Trophies: {1}{2} -> {3}
ru: {0} измененил трофеи: {1}{2} -> {3}

# fmtNotifyMemberExit
source: Member {0} left clan
ru: {0} покинул клан

# fmtNotifyMemberNew
source: New member {0}
ru: Новый участник {0}

# fmtNotifyWarClanEnd
source: Clan war end: {0} {2}%-{3}% : {1}{4}
ru: Клановая война окончена: {0} {2}%-{3}% : {1}{4}

# CoCNotifyRssDesc
source: Clan #{0} updated statistic time line (RSS feed). Create: {1}
ru: Клан # {0} обновление статистики ОнЛайн (RSS канал). Создан: {1}

# CoCNotifyRssCopy
source: (c) stCoCServer RSS feed
ru: (С) stCoCServer RSS канал

# ShedWaitProcess
source: End update CoC DB: [{0} sec]
ru: Время обновления CoC базы: [{0} сек]

# ShedStopProcess
source: Stop update CoC DB: [{0}]
ru: Обновление CoC базы остановлено: [{0}]

# ShedStartProcess
source: Start update CoC DB: [{0}]
ru: Запуск обновления CoC базы: [{0}]

# ShedNextProcess
source: Next update CoC DB: [{0}]
ru: Следующее обновление CoC базы: [{0}]

# ShedCanceledProcess
source: Canceled update CoC DB: [{0}]
ru: Отменено обновление CoC базы: [{0}]

# DataTableEmptyIn
source: Empty input Json Data: {0} Table
ru: Входные Json данные пусты, Таблица: {0}

# CurlReturnReason
source: Get json unknown error
ru: При получении Json возникла неизвестная ошибка

# CurlObjEmpty
source: Curl instance is empty
ru: экземпляр Curl обьекта пуст

# CoCUrlEmpty
source: CoC API URL create error, URL empty
ru: Создание CoC API URL привело к ошибке, URL пуст

# CoCRequestIdEmpty
source: Request ID is wrong or not defined
ru: Идентификатор запроса неправильный или не определен

# CoCNotifyRssTitle
source: CoC notify update time line
ru: уведомления обновлений ОнЛайн

# CoCNotifyDataSseSend
source: Data send
ru: Информация отправлена

# CoCNotifySendPart
source: Send part
ru: Эвент отправлен

# CoCNotifySetHeader
source: Set header
ru: Заголовок установлен

# CoCNotifyHostDataCount
source: Host/Data count
ru: Хост/Дата

# fmtNotifyHeaderCount
source: Available {0} update in clan, modified time: {1}, next: {2}
ru: Получено {0} новых обновлений клана, время запроса: {1}, следующее {2}

# fmtNotifyMemberChangeDonationReceive
source: {0} - change Donation Receive {1}{2} -> {3}
ru: {0} измененил полученное подкрепление: {1}{2} -> {3}

# fmtNotifyWarClanEndVs
source: vs
ru: на

# fmtRrdClanChangePointsMax
source: Maximum Clan points: @0@r
ru: Максимальные очки клана: @0@r

# fmtRrdClanChangePointsMin
source: Minimum Clan points: @0@r
ru: Минимальные очки клана: @0@r

# fmtRrdClanChangePointsTitle
source: Clan change Points
ru: Изменение Очков клана

# fmtRrdClanChangePointsVlabel
source: clan points
ru: очки клана

# fmtRrdClanChangeWarWinTitle
source: Clan War wins
ru: Выигранные войны клана

# fmtRrdClanChangeWarWinVlabel
source: war wins
ru: выигранные войны

# fmtRrdMemberChangeDonationReceiveMax
source: Maximum receive donation: @0@r
ru: Максимально получено войск: @0@r

# fmtRrdMemberChangeDonationReceiveMin
source: Minimum receive donation: @0@r
ru: Минимально получено войск: @0@r

# fmtRrdMemberChangeDonationReceiveVlabel
source: receive troops
ru: получено войск

# fmtRrdMemberChangeDonationReceiveTitle
source: Clan Donation receive
ru: Получено войск в клане

# fmtRrdMemberChangeDonationSendTitle
source: Clan Donation send
ru: Пожертвовано войск в клане

# fmtRrdMemberChangeDonationSendVlabel
source: send troops
ru: пожертвовано войск

# fmtRrdMemberChangeDonationSendMax
source: Maximum send donation: @0@r
ru: Максимально пожертвовано войск: @0@r

# fmtRrdMemberChangeDonationSendMin
source: Minimum send donation: @0@r
ru: Минимально пожертвовано войск: @0@r

# RrdPeriodNameDay
source: Day
ru: День

# RrdPeriodNameMonth
source: Month
ru: Месяц

# RrdPeriodNameWeek
source: Week
ru: Неделя

# RrdPeriodNameYear
source: Year
ru: Год

# fmtRrdClanChangeWarWinMax
source: Maximum wars win: @0@r
ru: Выигранные войны за период: @0@r

# fmtRrdClanChangeWarWinMin
source: Minimum wars win: @0@r
ru: Выигранные войны на начало периода: @0@r

# CoCNotifyDisposeError
source: Notfy DEBUG SSE, client {0}/Dispose: {1}
ru: Уведомления - отладка, клиенты: {0}/удаленные: {1}

# CoCNotifyProcessDebug
source: Notify DEBUG SSE, Last Ip: {0}, {1} - {2}
ru: Уведомления - отладка, последний IP: {0}, {1} - {2}

# CoCNotifyProcessError
source: Notify DEBUG SSE, {0} error: {1} - {2}
ru: Уведомления - отладка, {0} ошибка: {1} - {2}

# CoCInformerError
source: [Informer error]: {0}
ru: [Ошибка Информера]: {0}
