Repository: PetersSharp/stCoCServer
Catalog: stCoCServer/stCoCServer/Properties/Resources.*.resx
Languages: ru

# cmdMissingArgument
source: incomptible argument count to command
ru: неподходящее количество аргументов для команды

# PrnRunIrcHelp
source: type @help for ask me..
ru: Напишите @help для того чтобы спросить меня..

# fmtClanDonation
source: TOP {0} best warrior donation {1} in Clan members
ru: ТОП {0} лучших пожертвований {1} в клане

# fmtFetchTitle
source: {0}, URL '{1}' is: {2}
ru: {0}, URL '{1}' называется: {2}

# cmdFetchTitleError
source: {0} error fetching website title: {1}
ru: {0} ошибка выборки названия сайта: {1}

# cmdUrlShortOK
source: {0}, yor URL '{1}' is shorted: {2}
ru: {0}, URL '{1}' сокращен: {2}

# cmdUrlShortError
source: URL '{0}' error: {1}
ru: URL {0} ошибка: {1}

# cmdUserPrivateOnly
source: system management command send only in private message!
ru: Команды управления системой могут отправлять только личные сообщения

# cmdSetUserModeOk
source: {0} set user mode for channel {1}: "{2}"
ru: {0} задать режим пользователя для канала {1}: '{2}'

# cmdSetTopicOk
source: {0} set topic to channel {1}: "{2}"
ru: {0} задать тему для канала {1}: '{2}'

# cmdEmptyBody
source: no command body set
ru: команда пуста

# cmdUserNotAllowed
source: wrong authorize string, abort
ru: неверная авторизация, отменено!

# PrnConnected
source: Connected: {0} / Channel: {1}
ru: Подключение: {0} / канал: {1}

# prnYes
source: YES
ru: Да

# prnNo
source: NO
ru: Нет

# cmdQueryWrong
source: you request is wrong
ru: запрос неправильно

# cmdQueryEmpty
source: no iformation for you request
ru: запрос не информация для вас

# cnfEmpty
source: Configuration empty or null
ru: Конфигурация пуста

# cmdNoSQL
source: statistic base temporary down..
ru: Статистика базы временно недоступна

# cmdNotConnect
source: [CMD Parser]: irc client not connected..
ru: [CMD анализатор]: IRC клиент не подключен..

# PrnRun
source: {0} is running.. [{1}]
ru: {0} выполняется... [{1}]

# PrnExit
source: Exited gracefully..
ru: Выход завершен удачно

# fmtTime
source: {0}{1} Time: {2}
ru: {0} {1} время: {2}

# fmtUpTime
source: {0}{1} UpTime: {2}
ru: {0} {1} время ОнЛайн: {2}

# fmtSpeak
source: {0}{1} speak: {2}
ru: {0} {1} говорит: {2}

# PrnOK
source: OK
ru: Ок

# fmtMembersTotal
source: Total members: {0}/50
ru: Всего участников: {0}/50

# httpDateLogTitle
source: IRC archive logging for: {0}-{1}-{2}
ru: IRC архив для ведения журнала: {0} - {1} - {2}

# httpLogNotFound
source: IRC Log not found for date {0}-{1}-{2}
ru: IRC журнал не найден для даты {0}-{1}-{2}

# ircLogArchive
source: IRC channel '{0}' Log Archive
ru: IRC канал '{0}' Архив журнала

# fmtClanWar
source: Show {0} Clan Wars statistic
ru: Статистика {0} клановых войн

# cmdIrcQueryEmpty
source: empty IRC CoC command query
ru: пустой запрос IRC команды

# fmtConfErrorException
source: Configuration error: {0}
ru: Ошибка конфигурации: {0}!

# fmtConfMissException
source: Configuration missing: {0}
ru: Отсутствует настройки: {0}

# ircBootDisabled
source: IRC Bot disabled in configuration
ru: IRC Бот отключен в конфигурации!

# httpServerDisabled
source: HTTP server disabled in configuration
ru: HTTP сервер отключен в конфигурации!

# serviceCoCApiStarted
source: service: CoC Update started..
ru: Сервис: началось обновление CoC базы..

# serviceIrcLogStarted
source: service: IRC Logging started..
ru: Сервис: IRC журнал открыт..

# serviceTemplateStarted
source: service: HTTP Template started..
ru: Сервис: HTTP Шаблонизатор запущен..

# serviceHttpStarted
source: service: HTTP Server started..
ru: Сервис: HTTP сервер запущен..

source: service: IRC Bot started..
ru: Сервис: IRC бот запущен..

# serviceGeoStarted
source: service: IP GEO Filter started..
ru: Сервис: IP GEO фильтр запущен..

# GeoFilterDisabled
source: IP GEO Filter disabled in configuration
ru: IP-GEO фильтр отключен в конфигурации

source: service: SysLog started..
ru: Сервис: SysLog запущен..

# serviceSysLogStartFailed
source: service: SysLog start failed: {0}
ru: Сервис: не удалось запустить SysLog: {0}

# serviceSysLogSendFailed
source: service: SysLog send failed: {0}
ru: Сервис: SysLog отправка не удалась: {0}

# PrnJob
source: {0} wait job event.. [{1}]
ru: {0} ождает следующее событие.. [{1}]

# fmtNotifyUrlError
source: Incorrect URL, use: <b>/notify/sse/</b>, <b>/notify/rss/</b>, <b>/notify/json/</b>
ru: Неправильный URL АДРЕС, используйте: <b>/notify/sse/</b>, <b>/notify/rss/</b>, <b>/notify/json/</b>

# cmdPluginDisabled
source: this Plugin Disabled from configuration
ru: Этот плагин отключен в конфигурации

# prnLangCulture
source: using current language: {0}
ru: текущий языка интерфейса: {0}

# PrnError
source: ERROR
ru: ОШИБКА

# SysLogDisabled
source: SysLog disabled in configuration
ru: SysLog отключен в конфигурации!

# cmdQueryError
source: error return query request
ru: Запроса вернул ошибку

# prnLangCultureError
source: error set language, '{0}': {1}
ru: ошибка установки языка, '{0}': {1}
